performance/raquetelio/results/wave2_Tests_50_114/20221117-18/artilleryRaceRegistration_result_Test58_2022-11-18-20-09-1668798565.txt
Phase started: Warm up (index: 0, duration: 30s) 20:09:29(+0100)

--------------------------------------
Metrics for period to: 20:09:40(+0100) (width: 9.015s)
--------------------------------------

http.codes.201: ................................................................ 10
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 10
http.response_time:
  min: ......................................................................... 12
  max: ......................................................................... 25
  median: ...................................................................... 16
  p95: ......................................................................... 19.9
  p99: ......................................................................... 19.9
http.responses: ................................................................ 10
vusers.completed: .............................................................. 10
vusers.created: ................................................................ 10
vusers.created_by_name.Register in Race by Order: .............................. 10
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 15.4
  max: ......................................................................... 62.1
  median: ...................................................................... 26.8
  p95: ......................................................................... 33.5
  p99: ......................................................................... 33.5


Phase completed: Warm up (index: 0, duration: 30s) 20:09:59(+0100)

Phase started: Massive load (index: 1, duration: 30s) 20:09:59(+0100)

--------------------------------------
Metrics for period to: 20:09:50(+0100) (width: 9.026s)
--------------------------------------

http.codes.201: ................................................................ 10
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 10
http.response_time:
  min: ......................................................................... 6
  max: ......................................................................... 19
  median: ...................................................................... 16
  p95: ......................................................................... 19.1
  p99: ......................................................................... 19.1
http.responses: ................................................................ 10
vusers.completed: .............................................................. 10
vusers.created: ................................................................ 10
vusers.created_by_name.Register in Race by Order: .............................. 10
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 11.3
  max: ......................................................................... 34.1
  median: ...................................................................... 26.3
  p95: ......................................................................... 29.7
  p99: ......................................................................... 29.7


--------------------------------------
Metrics for period to: 20:10:00(+0100) (width: 9.488s)
--------------------------------------

http.codes.201: ................................................................ 94
http.codes.400: ................................................................ 74
http.request_rate: ............................................................. 94/sec
http.requests: ................................................................. 184
http.response_time:
  min: ......................................................................... 6
  max: ......................................................................... 85
  median: ...................................................................... 19.9
  p95: ......................................................................... 49.9
  p99: ......................................................................... 63.4
http.responses: ................................................................ 168
vusers.completed: .............................................................. 168
vusers.created: ................................................................ 186
vusers.created_by_name.Register in Race by Order: .............................. 186
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 8.3
  max: ......................................................................... 89.6
  median: ...................................................................... 29.7
  p95: ......................................................................... 59.7
  p99: ......................................................................... 70.1


--------------------------------------
Metrics for period to: 20:10:10(+0100) (width: 9.994s)
--------------------------------------

http.codes.201: ................................................................ 1041
http.codes.400: ................................................................ 1770
http.codes.500: ................................................................ 3
http.request_rate: ............................................................. 343/sec
http.requests: ................................................................. 3423
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 4735
  median: ...................................................................... 645.6
  p95: ......................................................................... 2059.5
  p99: ......................................................................... 2951.9
http.responses: ................................................................ 2814
vusers.completed: .............................................................. 2814
vusers.created: ................................................................ 3421
vusers.created_by_name.Register in Race by Order: .............................. 3421
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 7.8
  max: ......................................................................... 4737
  median: ...................................................................... 658.6
  p95: ......................................................................... 2101.1
  p99: ......................................................................... 2951.9


--------------------------------------
Metrics for period to: 20:10:20(+0100) (width: 9.999s)
--------------------------------------

http.codes.201: ................................................................ 897
http.codes.400: ................................................................ 1460
http.codes.500: ................................................................ 2
http.request_rate: ............................................................. 570/sec
http.requests: ................................................................. 5703
http.response_time:
  min: ......................................................................... 892
  max: ......................................................................... 8251
  median: ...................................................................... 3328.3
  p95: ......................................................................... 6187.2
  p99: ......................................................................... 6976.1
http.responses: ................................................................ 2359
vusers.completed: .............................................................. 2358
vusers.created: ................................................................ 5706
vusers.created_by_name.Register in Race by Order: .............................. 5706
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 893.4
  max: ......................................................................... 8254.1
  median: ...................................................................... 3395.5
  p95: ......................................................................... 6187.2
  p99: ......................................................................... 6976.1


--------------------------------------
Metrics for period to: 20:10:30(+0100) (width: 9.998s)
--------------------------------------

http.codes.201: ................................................................ 691
http.codes.400: ................................................................ 1354
http.codes.500: ................................................................ 1
http.request_rate: ............................................................. 506/sec
http.requests: ................................................................. 5053
http.response_time:
  min: ......................................................................... 5910
  max: ......................................................................... 15384
  median: ...................................................................... 9416.8
  p95: ......................................................................... 12459.8
  p99: ......................................................................... 12968.3
http.responses: ................................................................ 2046
vusers.completed: .............................................................. 2045
vusers.created: ................................................................ 5050
vusers.created_by_name.Register in Race by Order: .............................. 5050
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 5912
  max: ......................................................................... 15386.4
  median: ...................................................................... 9416.8
  p95: ......................................................................... 12459.8
  p99: ......................................................................... 12968.3


--------------------------------------
Metrics for period to: 20:10:40(+0100) (width: 9.979s)
--------------------------------------

http.codes.201: ................................................................ 799
http.codes.400: ................................................................ 1516
http.request_rate: ............................................................. 158/sec
http.requests: ................................................................. 1569
http.response_time:
  min: ......................................................................... 12165
  max: ......................................................................... 20820
  median: ...................................................................... 16486.1
  p95: ......................................................................... 19346.7
  p99: ......................................................................... 19737.6
http.responses: ................................................................ 2315
vusers.completed: .............................................................. 2317
vusers.created: ................................................................ 1570
vusers.created_by_name.Register in Race by Order: .............................. 1570
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 12166.7
  max: ......................................................................... 20823.9
  median: ...................................................................... 16486.1
  p95: ......................................................................... 19346.7
  p99: ......................................................................... 19737.6


Phase completed: Massive load (index: 1, duration: 30s) 20:10:49(+0100)

--------------------------------------
Metrics for period to: 20:10:50(+0100) (width: 9.997s)
--------------------------------------

http.codes.201: ................................................................ 766
http.codes.400: ................................................................ 1646
http.request_rate: ............................................................. 139/sec
http.requests: ................................................................. 1363
http.response_time:
  min: ......................................................................... 19272
  max: ......................................................................... 26614
  median: ...................................................................... 22703.7
  p95: ......................................................................... 25598.5
  p99: ......................................................................... 26115.6
http.responses: ................................................................ 2412
vusers.completed: .............................................................. 2412
vusers.created: ................................................................ 1362
vusers.created_by_name.Register in Race by Order: .............................. 1362
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 19273.2
  max: ......................................................................... 26616
  median: ...................................................................... 22703.7
  p95: ......................................................................... 25598.5
  p99: ......................................................................... 26115.6


--------------------------------------
Metrics for period to: 20:11:00(+0100) (width: 9.996s)
--------------------------------------

http.codes.201: ................................................................ 725
http.codes.400: ................................................................ 1488
http.request_rate: ............................................................. 145/sec
http.requests: ................................................................. 715
http.response_time:
  min: ......................................................................... 25174
  max: ......................................................................... 34275
  median: ...................................................................... 27730.6
  p95: ......................................................................... 31897.9
  p99: ......................................................................... 32542.3
http.responses: ................................................................ 2213
vusers.completed: .............................................................. 2210
vusers.created: ................................................................ 715
vusers.created_by_name.Register in Race by Order: .............................. 715
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 25175.4
  max: ......................................................................... 34283.4
  median: ...................................................................... 27730.6
  p95: ......................................................................... 31897.9
  p99: ......................................................................... 32542.3


--------------------------------------
Metrics for period to: 20:11:10(+0100) (width: 7.518s)
--------------------------------------

http.codes.201: ................................................................ 997
http.codes.400: ................................................................ 2684
http.codes.500: ................................................................ 2
http.response_time:
  min: ......................................................................... 10733
  max: ......................................................................... 33947
  median: ...................................................................... 22254.1
  p95: ......................................................................... 30040.3
  p99: ......................................................................... 31897.9
http.responses: ................................................................ 3683
vusers.completed: .............................................................. 3686
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 10738.9
  max: ......................................................................... 33948.9
  median: ...................................................................... 22254.1
  p95: ......................................................................... 30040.3
  p99: ......................................................................... 31897.9


All VUs finished. Total time: 1 minute, 45 seconds

--------------------------------
Summary report @ 20:11:12(+0100)
--------------------------------

http.codes.201: ................................................................ 6030
http.codes.400: ................................................................ 11992
http.codes.500: ................................................................ 8
http.request_rate: ............................................................. 229/sec
http.requests: ................................................................. 18030
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 34275
  median: ...................................................................... 15839.7
  p95: ......................................................................... 28862.3
  p99: ......................................................................... 31266.3
http.responses: ................................................................ 18030
vusers.completed: .............................................................. 18030
vusers.created: ................................................................ 18030
vusers.created_by_name.Register in Race by Order: .............................. 18030
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 7.8
  max: ......................................................................... 34283.4
  median: ...................................................................... 15839.7
  p95: ......................................................................... 28862.3
  p99: ......................................................................... 31266.3